principles/app/controllers/descriptions_controller.rb

  def index
    @descriptions = Description.all
---
SELECT * FROM "descriptions"

  def show
    @description = Description.find(params[:id])
---
SELECT * FROM "descriptions" WHERE ("descriptions"."id" = 1)

  def edit
    @description = Description.find(params[:id])
---
SELECT * FROM "descriptions" WHERE ("descriptions"."id" = 1)

  def create
    @description = Description.new(params[:description])

    respond_to do |format|
      if @description.save
---
INSERT INTO "descriptions" ("descshort", "created_at", "updated_at", "idShort") VALUES('qqqq', '2009-10-30 08:29:03', '2009-10-30 08:29:03', NULL)

  def update
    @description = Description.find(params[:id])

    respond_to do |format|
      if @description.update_attributes(params[:description])
---
SELECT * FROM "descriptions" WHERE ("descriptions"."id" = 1)
UPDATE "descriptions" SET "updated_at" = '2009-10-30 17:46:56', "descLong" = 'Divide an object into independent parts. Replace mainframe computer by personal computers. Replace a large truck by a truck and trailer. Use a work breakdown structure for a large project. Make an object easy to disassemble. Modular furniture. Quick disconnect joints in plumbing. Increase the degree of fragmentation or segmentation. Replace solid shades with Venetian blinds. Use powdered welding metal instead of foil or rod to get better penetration of the joint.' WHERE "id" = 1

  def destroy
    @description = Description.find(params[:id])
    @description.destroy
---
SELECT * FROM "descriptions" WHERE ("descriptions"."id" = 1)
DELETE FROM "descriptions" WHERE "id" = 1